# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetSet..::..Insert Method
AssetSet Class See Also
---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	Asset item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As Asset _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	Asset^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Visual..::..Asset
# See Also
AssetSet Class
Autodesk.Revit.DB.Visual Namespace